In [10]:
#pip install PyMySQL

Requirement already satisfied: PyMySQL in /Users/dhshin/.conda/envs/python/lib/python3.9/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pymysql
#임포트 -> connect -> 'cursor'객체 생성 -> 쿼리 작성 실행 cursor.execute()->commit() 
#-> fetchall(), fetchchone(),fetchmany(n)->close

In [22]:
con = pymysql.connect(host='localhost',
                           user='root',
                           password='0729tlsehd',
                           database='my_emp',
                           charset='utf8',
                           autocommit='True')#-> mysql -h localhost -u root -p

In [8]:
#print(con)
#print(dir(con)

In [14]:
#'cursor' 객체 생성
cur = con.cursor()

In [15]:
#쿼리작성 실행 cursor.execute()
sql = 'select ename, empno from emp'
cur.execute(sql)

14

In [23]:
#fetchall()
row_res=cur.fetchall()
print(row_res)
con.close()

()

In [18]:
import pandas as pd

In [19]:
my_res = pd.DataFrame(row_res)
my_res

         0     1
0    SMITH  7369
1    ALLEN  7499
2     WARD  7521
3    JONES  7566
4   MARTIN  7654
5    BLAKE  7698
6    CLARK  7782
7    SCOTT  7788
8     KING  7839
9   TURNER  7844
10   ADAMS  7876
11   JAMES  7900
12    FORD  7902
13  MILLER  7934

In [30]:
#2. 쿼리작성 my_emp 에다가 데이터를 입력해보자. 1, 홍길동, 800, 오늘날짜 
con = pymysql.connect(host='localhost',
                           user='root',
                           password='0729tlsehd',
                           database='my_emp',
                           charset='utf8')
cur = con.cursor()
sql = 'insert into my_emp(empno,ename,sal,hiredate)values(%s,%s,%s,now())'
cur.execute(sql,('1','홍길동',800))
con.commit();
with con.cursor() as cursor:
    sql = 'SELECT empno,ename,sal,hiredate FROM my_emp WHERE empno=%s'
    cursor.execute(sql,('1'))
    result = cursor.fetchall()
    print(result)
con.close

((1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)), (1, '홍길동', Decimal('800.00'), datetime.date(2023, 1, 5)))

In [ ]:
import pandas as pd
import pymysql.cursors

class MyClass:
    def __init__(self):
        self.mconpymysql.connect(host='localhost',
                           user='root',
                           password='0729tlsehd',
                           database='my_emp',
                           charset='utf8',
                           autocommit=False)
    def myexport_csv(self):
        exam_sql = 'select * from my_emp where empno=1'